package _02_请求转发说明;

/**
 * @author wx
 * @create 2023-05-13 16:51
 */
public class _1_请求转发的使用说明 {
}

/*

      客户端               SearchStudentServlet程序     请求转发            showStudent.jsp
关键字: ____ 搜索  ------>     1.获取请求的参数         ----------->       专门用来显示学生的数据
        ↑                     2.发sql语句到数据库中
        |                       去查询学生信息                             4.遍历查询到的结果输出给客户端，显示
        |                     3.保存查询到的学生信息，                                |
        |                       保存到request域中                                    |
        |                                                                           ↓
        -----------------------------------------------------------------------------
*/
